Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 1519)]       0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 1519)]       0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 1519)]       0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 1519)]       0                                            
__________________________________________________________________________________________________
input_5 (InputLayer)            [(None, 1519)]       0                                            
__________________________________________________________________________________________________
input_6 (InputLayer)            [(None, 1519)]       0                                            
__________________________________________________________________________________________________
input_7 (InputLayer)            [(None, 1519)]       0                                            
__________________________________________________________________________________________________
input_8 (InputLayer)            [(None, 1519)]       0                                            
__________________________________________________________________________________________________
input_9 (InputLayer)            [(None, 1519)]       0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 1000)         1520000     input_1[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1000)         1520000     input_2[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1000)         1520000     input_3[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1000)         1520000     input_4[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1000)         1520000     input_5[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 1000)         1520000     input_6[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1000)         1520000     input_7[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 1000)         1520000     input_8[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 1000)         1520000     input_9[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 9000)         0           dense[0][0]                      
                                                                 dense_1[0][0]                    
                                                                 dense_2[0][0]                    
                                                                 dense_3[0][0]                    
                                                                 dense_4[0][0]                    
                                                                 dense_5[0][0]                    
                                                                 dense_6[0][0]                    
                                                                 dense_7[0][0]                    
                                                                 dense_8[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 4500)         40504500    concatenate[0][0]                
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 900)          4050900     dense_9[0][0]                    
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 4500)         4054500     dense_10[0][0]                   
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 9000)         40509000    dense_11[0][0]                   
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 1000)         9001000     dense_12[0][0]                   
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1000)         9001000     dense_12[0][0]                   
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 1000)         9001000     dense_12[0][0]                   
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 1000)         9001000     dense_12[0][0]                   
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 1000)         9001000     dense_12[0][0]                   
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 1000)         9001000     dense_12[0][0]                   
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 1000)         9001000     dense_12[0][0]                   
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 1000)         9001000     dense_12[0][0]                   
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 1000)         9001000     dense_12[0][0]                   
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 1519)         1520519     dense_13[0][0]                   
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 1519)         1520519     dense_14[0][0]                   
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 1519)         1520519     dense_15[0][0]                   
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 1519)         1520519     dense_16[0][0]                   
__________________________________________________________________________________________________
dense_26 (Dense)                (None, 1519)         1520519     dense_17[0][0]                   
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 1519)         1520519     dense_18[0][0]                   
__________________________________________________________________________________________________
dense_28 (Dense)                (None, 1519)         1520519     dense_19[0][0]                   
__________________________________________________________________________________________________
dense_29 (Dense)                (None, 1519)         1520519     dense_20[0][0]                   
__________________________________________________________________________________________________
dense_30 (Dense)                (None, 1519)         1520519     dense_21[0][0]                   
==================================================================================================
Total params: 197,492,571
Trainable params: 197,492,571
Non-trainable params: 0
__________________________________________________________________________________________________
